# Assessment for the Position of Data Scientist Trainee

## by ETH Smart Contract Tech Ecosystem Limited

We has been provided with a Mentz, Decker, GmbH & Co. KG's report on containership fixture which was done on 26th March 2021. This report describes data on the containers and their main characteristics such as TEU, speed, sailing schedules and etc.  
  
Apart from pdf version of this report, assessors gave us initial stages of its processing which consisted of dividing input data into separate features and converting numerical properties into integer data type.

Therefore, I was instructed to continue reformating this data as a part of Data Scientist's basic responsibility.

In [2]:
# importing all the necessary libraries for our analysis:

import pandas as pd

In [3]:
# importing the last sheet of a given excel file, 
# to continue with its reformating

last_sheet = pd.ExcelFile('C:\\Users\\Admin\\Downloads\\MentzDecker.xlsx')
data = pd.read_excel(last_sheet, 'step2')

In [4]:
# to general exploration of a dataset:

data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             42 non-null     object
 1   IMO              0 non-null      float64
 2   Year             41 non-null     float64
 3   TEU              42 non-null     int64
 4   TEU@14           42 non-null     int64
 5   DWT              42 non-null     int64
 6   Type             42 non-null     object
 7   Unnamed: 7       0 non-null      float64
 8   Speed            42 non-null     object
 9   Note             41 non-null     object
 10  opt              20 non-null     object
 11  Min              42 non-null     int64
 12  Max              19 non-null     float64
 13  unit             42 non-null     object
 14  trade            42 non-null     object
 15  acct             42 non-null     object
 16  ccy              42 non-null     object
 17  value            42 non-null     int64
 18  value note       42 non-null     object
 19  date             42 non-null     object
 20  additional note  5 non-null      object
dtypes: float64(4), int64(5), object(12)
memory usage: 7.0+ KB

,Name,IMO,Year,TEU,TEU@14,DWT,Type,Unnamed: 7,Speed,Note,...,Min,Max,unit,trade,acct,ccy,value,value note,date,additional note
0,Seamax Niantic,NaN,2014.0,9034,7400,111890,GLCE,NaN,22kn,124.9ts,...,60,NaN,mos,TBA TRADE,ZIM,USD,55000,about/day,2021-05-01 00:00:00,NaN
1,Northern Jamboree,NaN,2010.0,8814,6923,108828,GLCE,NaN,24kn,217ts,...,48,NaN,mos,FAR EAST/W.C. NORTH AMERICA TRADE,MSC,USD,45000,about/day,2021-06-01 00:00:00,NaN
2,Northern Javelin,NaN,2009.0,8814,6923,108677,GLCE,NaN,25.4kn,249ts,...,48,NaN,mos,CONTINENT/FAR EAST/AUSTRALIA/NEW ZEALAND TRADE,MSC,USD,45000,about/day,2021-05-01 00:00:00,NaN
3,Northern Jubilee,NaN,2009.0,8814,6923,108500,GLCE,NaN,23kn,192ts,...,48,NaN,mos,EUROPE/MIDDLE EAST/INDIAN OCEAN TRADE,MSC,USD,45000,about/day,2021-08-01 00:00:00,NaN
4,MSC Alessia,NaN,2001.0,6732,5150,84920,GLCE,NaN,25.5kn,230ts 380cst,...,36,NaN,mos,MIDDLE EAST/E. AFRICA/S. AFRICA TRADE,MSC,USD,33000,/day average,2021-05-01 00:00:00,NaN

From the above table, we can see that our data consist of 42 data entries and 20 features. While 12 of those features are represented as *object* data type, the others are given in numerical data types. 

Most of the columns are complete (contains all 42 data entries), but still there are several features containing NULL values.

Also, we could observe that there are two columns which completely composed of NULL values. These are *IMO* and *Unnamed: 7*. So, we could see that IMO numbers of ships are not given for this data, therefore, these columns might be dropped.

### Dropping columns without any useful data:

In [5]:
# dropping of the "IMO" and "Unnamed::7" columns:

data.drop(["IMO", "Unnamed: 7"], inplace=True, axis=1)

---

### Renaming column names:

After dropping unnecessary columns, we can rename column names to make it more intuitive for understanding.
Also, I believe that it would be better to standartize them into one format which is a **snakecase** in this assessment.

In [6]:
# renaming column names:

data.rename(columns={'Name': 'ship_name',
                     'Year': 'ship_production_year',
                     'Type': 'type_of_ship',
                     'Speed': 'speed(in kn)',
                     'Note': 'speed_note',
                     'opt': 'period_specification',
                     'Min': 'min_reaching_time',
                     'Max': 'max_reaching_time',
                     'unit': 'unit_of_period',
                     'trade': 'name_of_trade',
                     'acct': 'account_name',
                     'ccy': 'currency',
                     'value': 'amount_of_money',
                     'value note': 'note_on_money',
                     'date': 'scheduled_date',
                     'additional note': 'additional_notes'}, inplace=True)

In [7]:
data.columns

Index(['ship_name', 'ship_production_year', 'TEU', 'TEU@14', 'DWT',
       'type_of_ship', 'speed(in kn)', 'speed_note', 'period_specification',
       'min_reaching_time', 'max_reaching_time', 'unit_of_period',
       'name_of_trade', 'account_name', 'currency', 'amount_of_money',
       'note_on_money', 'scheduled_date', 'additional_notes'],
      dtype='object')

---

### Ship_production_year column:

After renaming of all remaining columns, we can go through each column and define any issue or standartization errors that should be fixed.  
  
For *ship_production_year* column, I believe that it might be better to apply **integer** data type as years are usually not a rational numbers. Also, we filled a missing value with **NaN**.

In [8]:
# filling missing values of a column and converting it into integer data type:

data["ship_production_year"] = data["ship_production_year"].fillna(0)
data["ship_production_year"] = data["ship_production_year"].astype(int)
data.loc[data.loc[:, "ship_production_year"]==0, "ship_production_year"] = None

---

### TEU and DWT columns:

According from my investigation, TEU represents how many 20-foot containers could be carried by a given ship, while DWT stands for the maximum deadweight of the ship including container TEU, people, reserves and etc.  
  
Therefore, it appears obvious that DWT for a ship must be more than TEU of a ship. However, we need to double check it in our report to avoid wrong data inputs.

In [9]:
# for each raw in dataframe compares its TEU with DWT. If miscorrelation is observed, "Wrong input data" warning is raised

for i in range(data.shape[0]):
    if data.iloc[i, 2] >= data.iloc[i, 4]:
        print("Wrong data input for ship: ", data.iloc[i, 0])       ### warning message is printed

As we run the above code, we can confirm that there are no wrong input data in the given report. I believe that this type of checking is extremely crucial during data reformation process.

---

### Speed column:

Next, we can standartize the *speed(in kn)* column into numerical data type. This step will facilitate the report's analysis as we can apply mathematical equations on numerical data.

In [10]:
# converting 'speed' column into numerical data:

data["speed(in kn)"] = data["speed(in kn)"].str.replace('kn', '').astype(float)

---

### Speed_note column:

Firstly, we could observe that this column contains data with different units and this should be converted into a common one. 

* For example, while most of the *speed_note* column inputs are given with ts and cst units, there is a *Northern Promotion* ship which is using **ifo** as its unit. Therefore, this should be converted into common unit of measurement.

(I do not know the relationship between *ifo* and *cst or ts*, but I would like to show that I am capable to modify this kind of mismatches in data. Therefore, I will be directly converting *ifo* into *cst*, even though it is incorrect.)

In [11]:
# converted ifo units into cst units (also, a correct formula could be applied):

data.loc[data['speed_note'].str.contains('ifo', na=False), ['speed_note']] = data[data['speed_note'].str.contains('ifo', na=False)].speed_note.str.replace('ifo', '0cst')

---

This column still need modifications as it consists of both **numbers** and thier **units** like *9ts* or *380cst*. However, as it is defined with object data type, we cannot do any mathematical equations during the report analysis. Therefore, I believe that it should be modified in a way that numerical alterations can be applied.

We could also observe that several raws contain additional specifications in the *speed_note* column. 

* For example, *TRF Partici* ship has a speed_note of 126.3ts 380cst+5ts 380cst. Therefore, we can divide this column into two parts as **speed_note_main** and **speed_note_additional** to specify the main part (126.3ts 380cst) and additional part (5ts 380cst).

In [12]:
# spliting 'speed_note' column into two parts: main and additional

data[['speed_note_main', 'speed_note_additional']] = data['speed_note'].str.split('+', expand=True)

This step seems still not enough as columns are still in object data type (contains words). Therefore, we can split them further into **ts containing** and **cst containing** parts. 
* For the above example, the *speed_note_main* column can be further splitted into another two columns: **speed_note_main (ts)** and **speed_note_main (cst)**. Then, we can convert this columns into numerical data type which supports mathematical equations.  
  
The same procedure could be applied for *speed_note_additional* column.

In [13]:
# further splitting 'speed_note_main' and 'speed_note_additional' into ts containing and cst containing parts:

data[['speed_note_main (ts)', 'speed_note_main (cst)']] = data['speed_note_main'].str.split(expand=True)
data[['speed_note_additional (ts)', 'speed_note_additional (cst)']] = data['speed_note_additional'].str.split(expand=True)

data['speed_note_main (ts)'] = data['speed_note_main (ts)'].str.replace('ts', '').astype(float)
data['speed_note_main (cst)'] = data['speed_note_main (cst)'].str.replace('cst', '').astype(float)
data['speed_note_additional (ts)'] = data['speed_note_additional (ts)'].str.replace('ts', '').astype(float)
data['speed_note_additional (cst)'] = data['speed_note_additional (cst)'].str.replace('cst', '').astype(float)

In [14]:
# to move newly added columns into correct position and drop transitional columns:

data.drop(["speed_note_main", "speed_note_additional"], inplace=True, axis=1)
before_cols = ['ship_name', 'ship_production_year', 'TEU', 'TEU@14', 'DWT', 'type_of_ship', 'speed(in kn)', 'speed_note', 'speed_note_main (ts)', 'speed_note_main (cst)', 'speed_note_additional (ts)', 'speed_note_additional (cst)']
cols = before_cols + [col for col in data if col not in before_cols]
data = data[cols]
data.head()

,ship_name,ship_production_year,TEU,TEU@14,DWT,type_of_ship,speed(in kn),speed_note,speed_note_main (ts),speed_note_main (cst),...,min_reaching_time,max_reaching_time,unit_of_period,name_of_trade,account_name,currency,amount_of_money,note_on_money,scheduled_date,additional_notes
0,Seamax Niantic,2014.0,9034,7400,111890,GLCE,22.0,124.9ts,124.9,NaN,...,60,NaN,mos,TBA TRADE,ZIM,USD,55000,about/day,2021-05-01 00:00:00,NaN
1,Northern Jamboree,2010.0,8814,6923,108828,GLCE,24.0,217ts,217.0,NaN,...,48,NaN,mos,FAR EAST/W.C. NORTH AMERICA TRADE,MSC,USD,45000,about/day,2021-06-01 00:00:00,NaN
2,Northern Javelin,2009.0,8814,6923,108677,GLCE,25.4,249ts,249.0,NaN,...,48,NaN,mos,CONTINENT/FAR EAST/AUSTRALIA/NEW ZEALAND TRADE,MSC,USD,45000,about/day,2021-05-01 00:00:00,NaN
3,Northern Jubilee,2009.0,8814,6923,108500,GLCE,23.0,192ts,192.0,NaN,...,48,NaN,mos,EUROPE/MIDDLE EAST/INDIAN OCEAN TRADE,MSC,USD,45000,about/day,2021-08-01 00:00:00,NaN
4,MSC Alessia,2001.0,6732,5150,84920,GLCE,25.5,230ts 380cst,230.0,380.0,...,36,NaN,mos,MIDDLE EAST/E. AFRICA/S. AFRICA TRADE,MSC,USD,33000,/day average,2021-05-01 00:00:00,NaN

Now, our newly added columns (speed_note_main and speed_note_additional) are positioned next to *speed_note* column by making it more intuitive for understanding.  
  
Also, now all *speed_note* column's values are converted into numerical type which allows calculations during analysis.

---

### Max and Min columns:

We can further observe that one row in the *Min* and *Max* columns are given in days, while the others are given in month. This should be standartized into month for all data entries to ease its analysis.

In [15]:
# to confirm that one row is represented in 'days':

data["unit_of_period"].value_counts()

mos     41
days     1
Name: unit_of_period, dtype: int64

In [16]:
# convering this row into month:
# (we assumed that: months = days / 30)

data.loc[data.loc[:, "unit_of_period"]=="days", "min_reaching_time"] = data.loc[data.loc[:, "unit_of_period"]=="days", "min_reaching_time"] / 30
data.loc[data.loc[:, "unit_of_period"]=="days", "max_reaching_time"] = data.loc[data.loc[:, "unit_of_period"]=="days", "max_reaching_time"] / 30
data.loc[data.loc[:, "unit_of_period"]=="days", "unit_of_period"] = "mos"

---

### Unit column:

In my opinion, *mos* does not really intuitive in this column. As many people might be working with the same dataset, we should try to make it as much intuitive as possible. Therefore, I will modify all entries of this column in '*months*' as it consists of 42 entries only.

(Remark: if our dataset consisted from several thousands of rows, it would be more efficient to specify that **mos = month** in a column name. For example, "*unit_of_period (mos=month)*")

In [17]:
# modifying all mos into month

data.loc[data['unit_of_period'].str.contains('mos', na=False), ['unit_of_period']] = 'months'

---

### Date column:

This column also contains non-standartized inputs such as '16th MAY/2021' or 'APR-MAY/2021'. However, I maintain that I would probably need further eloboration from other analyst teams in conversion of these inputs.
* One method would be living as it is now. Because *scheduled_data* feature is considered important in shipping and changes on it might lead to misinformation and subsequently inaccurate analysis.

Therefore, I believe that communication skills are crucial for this role. Fortunately, I am confident on my communication skills and suitableness for this role.

---

## Final Results:

Let's finally observe the results our the above modifications.

In [18]:
data.info()
data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 42 entries, 0 to 41
Data columns (total 23 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ship_name                    42 non-null     object
 1   ship_production_year         41 non-null     float64
 2   TEU                          42 non-null     int64
 3   TEU@14                       42 non-null     int64
 4   DWT                          42 non-null     int64
 5   type_of_ship                 42 non-null     object
 6   speed(in kn)                 42 non-null     float64
 7   speed_note                   41 non-null     object
 8   speed_note_main (ts)         41 non-null     float64
 9   speed_note_main (cst)        34 non-null     float64
 10  speed_note_additional (ts)   7 non-null      float64
 11  speed_note_additional (cst)  6 non-null      float64
 12  period_specification         20 non-null     object
 13  min_reaching_time            42 non-null     float64
 14  max_reaching_time            19 non-null     float64
 15  unit_of_period               42 non-null     object
 16  name_of_trade                42 non-null     object
 17  account_name                 42 non-null     object
 18  currency                     42 non-null     object
 19  amount_of_money              42 non-null     int64
 20  note_on_money                42 non-null     object
 21  scheduled_date               42 non-null     object
 22  additional_notes             5 non-null      object
dtypes: float64(8), int64(4), object(11)
memory usage: 7.7+ KB

,ship_name,ship_production_year,TEU,TEU@14,DWT,type_of_ship,speed(in kn),speed_note,speed_note_main (ts),speed_note_main (cst),...,min_reaching_time,max_reaching_time,unit_of_period,name_of_trade,account_name,currency,amount_of_money,note_on_money,scheduled_date,additional_notes
0,Seamax Niantic,2014.0,9034,7400,111890,GLCE,22.0,124.9ts,124.9,NaN,...,60.0,NaN,months,TBA TRADE,ZIM,USD,55000,about/day,2021-05-01 00:00:00,NaN
1,Northern Jamboree,2010.0,8814,6923,108828,GLCE,24.0,217ts,217.0,NaN,...,48.0,NaN,months,FAR EAST/W.C. NORTH AMERICA TRADE,MSC,USD,45000,about/day,2021-06-01 00:00:00,NaN
2,Northern Javelin,2009.0,8814,6923,108677,GLCE,25.4,249ts,249.0,NaN,...,48.0,NaN,months,CONTINENT/FAR EAST/AUSTRALIA/NEW ZEALAND TRADE,MSC,USD,45000,about/day,2021-05-01 00:00:00,NaN
3,Northern Jubilee,2009.0,8814,6923,108500,GLCE,23.0,192ts,192.0,NaN,...,48.0,NaN,months,EUROPE/MIDDLE EAST/INDIAN OCEAN TRADE,MSC,USD,45000,about/day,2021-08-01 00:00:00,NaN
4,MSC Alessia,2001.0,6732,5150,84920,GLCE,25.5,230ts 380cst,230.0,380.0,...,36.0,NaN,months,MIDDLE EAST/E. AFRICA/S. AFRICA TRADE,MSC,USD,33000,/day average,2021-05-01 00:00:00,NaN

In [20]:
# finally, we export the resulted table into excel file

data.to_excel('C:\\Users\\Admin\\Downloads\\MentzDecker_modified.xlsx')

## Further modifications:

All the above procedures are done as a first step of data analysis via converting into standard structure. However, many proceeding steps are needed to come up with useful insights.  
   
Therefore, I considere the above steps as one part of data cleaning.